Revit 2027 API
NurbsSurfaceData.IsRational Property
 Tells if the spline is rational or not. If it is true (rational), then the NURBS is a piecewise rational polynomial function. If it is false (non-rational), then the NURBS is a piecewise polynomial function.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRational { get; }
Public ReadOnly Property IsRational As Boolean
	Get
public:
property bool IsRational {
	bool get ();
}
member IsRational : bool with get
Property Value
Boolean
See Also
Reference
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace